# 1. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს "n" და ბეჭდავს 1-დან "n"-მდე რიცხვების ჯამს.
number = int(input("შეიყვანეთ რიცხვი n: "))
total_sum = 0
for i in range(1, number + 1):
    total_sum += i 
print("1-დან", number, "მდე რიცხვების ჯამი არის:", total_sum)  


# 2. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს და შემდეგ იყენებს "while" ციკლს რომ რევესრულად დაბეჭდოს რიცხვები 0-მდე. მაგალითად თუ შეიყვანს 4, დაიბეჭდოს 4, 3, 2, 1
number = int(input("შეიყვანეთ რიცხვი: "))
while number > 0:
    print(number)
    number -= 1


# 3. დაწერეთ პითონის პროგრამა თამაშისთვის, რომელიც მუდმივად სთხოვს მომხმარებელს გამოიცნოს წინასწარ განსაზღვრული რიცხვი. როდესაც მომხმარებელი გამოიცნობს სწორ რიცხვს, დაასრულებს პროგრამა მუშაობას.

import random
secret_number = random.randint(1, 100)
guess = 0
while guess != secret_number:
    guess = int(input("გამოიცანი რიცხვი 1-დან 100-მდე: "))
    if guess < secret_number:
        print("მეტი")
    elif guess > secret_number:
        print("ნაკლები")
    else:
        print("გილოცავ! გამოიცანი.")

# 4. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი ცვლადი total_sum = 0, შეამოწმეთ რიცხვი თუ დადებითია, მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს. ეს პროცესი გაგრძელდეს იქამდე სანამ მომხმარებელი არ შეიყვანს 'sum' ტექსტს, რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი.
while True:
    data = input("შეიყვანე რიცხვი ან 'sum' ჯამის გამოსათვლელად: ")
    if data.lower () == 'sum':
        break
    number = float(data)
    if number > 0:
            total_sum += number   
    else:
        print("გთხოვთ შეიყვანოთ დადებითი რიცხვი ან 'sum' ჯამის გამოსათვლელად.")
print("შეყვანილი დადებითი რიცხვების ჯამი არის:", total_sum)