# 1. კონსოლიდან შეიტანეთ ორი რიცხვი და დაბეჭდეთ ყველა არითმეტიკული ოპერაცია 
# (მიმატება, გამოკლება, გამრავლება, ჩვეულებრივი გაყოფა, მთელზე გაყოფა, ნაშთის აღება, ახარისხება).
x = int(input('შეიყვანეთ x-ის მნიშვნელობა:'))
y = int(input('შეიყვანეთ y-ის მნიშვნელობა:'))
print("x + y = ", x + y)
print("x - y = ", x - y)
print("x * y = ", x * y)
print("x / y = ", x / y)
print("x // y = ", x // y)
print("x % y = ", x % y)
print("x ** y = ", x ** y)

# 2. დაწერეთ პროგრამა რომბის ფართობის გამოსათვლელად. 
# მომხმარებელს კლავიატურის გამოყენებით შეაქვს ორი დიაგონალის სიგრძე.

d1 = float(input('შეიყვანეთ პირველი დიაგონალის სიგრძე: '))
d2 = float(input('შეიყვანეთ მეორე დიაგონალის სიგრძე: '))
area = (d1 * d2) / 2
print('რომბის ფართობი არის: ', area)


# 3. მომხმარებელის შეაქვს მეტრების რაოდენობა. დაბეჭდეთ შესაბამისი მნიშვნელობა სანტიმეტრებში, დეციმეტრებში, მილიმეტრებში, მილში.

m = float(input('შეიყვანეთ მეტრების რაოდენობა: '))
cm = m * 100    
dm = m * 10
mm = m * 1000
miles = m * 0.0006214
print(m, 'მეტრი არის ', cm, 'სანტიმეტრი')
print(m, 'მეტრი არის ', dm, 'დეციმეტრი')
print(m, 'მეტრი არის ', mm, 'მილიმეტრი')
print(m, 'მეტრი არის ', miles, 'მილი')

# 4. დაწერეთ პროგრამა, რომელიც ითვლის სამკუთხედის ფართობს. მომხმარებელს კონსოლიდან შეყავს სამკუთხედის სიმაღლისა და ფუძის მნიშვნელობა.

h = float(input('შეიყვანეთ სამკუთხედის სიმაღლე: '))
b = float(input('შეიყვანეთ სამკუთხედის ფუძე: '))
area=(h * b) / 2
print('სამკუთხედის ფართობი არის: ', area)

# 5. კონსოლიდან შეიტანეთ ორნიშნა რიცხვი და დაბეჭდეთ ციფრთა ჯამი.
num = int(input('შეიყვანეთ ორნიშნა რიცხვი: '))
a = num // 10
b = num % 10
print('ციფრთა ჯამი არის: ', a + b)
