# 1. დაწერეთ პითონის პროგრამა, რომელიც დასაწყისში შექმნის ცარიელ სიას ([]), თუ მომხარებელი შეიყვანს სიმბოლო 'a'-ს, ნიშნავს რომ უნდა დაამატოთ სიაში რიცხვი; თუ აკრიფა 'r', სიიდან უნა წაიშალოს რიცხვი; 'e'-ს შეტანისას პროგრამამ უნდა დაასრულოს მუშაობა. მიღებული შედეგი დაბეჭდეთ კონსოლში.

# a – append

# r – remove

# e – exit

# გამოიყენეთ მხოლოდ ეს ბრძანებები და მოახდინეთ სიაზე ზემოქმედება.

my_list = []
while True:
    add_remove_exit = input("თუ გსურთ დაამატოთ რიცხვი, აკრიფეთ 'a', თუ გსურთ წაშალოთ რიცხვი, აკრიფეთ 'r', თუ გსურთ გამოსვლა, აკრიფეთ 'e':")
    data = int(input("შეიყვანეთ რიცხვი, რომელიც გსურთ დაამატოთ სიაში: "))
    if add_remove_exit == 'a':
        my_list.append(data)
        print("სიაში დამატებულია რიცხვი:", data)
        print("მიმდინარე სია:", my_list)
    elif add_remove_exit == 'r':
        if data in my_list:
            my_list.remove(data)
            print("სიიდან წაიშალა რიცხვი:", data)
            print("მიმდინარე სია:", my_list)
        else:
            print("რიცხვი სიაში არ არის.")
    elif add_remove_exit == 'e':
        print("პროგრამა დასრულდა.")
        break
    else:
        print("გთხოვთ შეიყვანოთ ვალიდური ბრძანება.")


# 2. დაწერეთ პითონის პროგრამა, რომელიც შექმნის სიას my_list_1 = [43, '22', 12, 66, 210, ["hi"]], და შეასრულებს შემდეგ ნაბიჯებს:

my_list_1 = [43, '22', 12, 66, 210, ["hi"]]

# a. დაბეჭდავს 210-ის ინდექსს;
indexes = my_list_1.index(210)
print("210-ის ინდექსი არის:", indexes)
 
# b. დაამატებს ბოლო ელემენტში ტექსტს "hello";
my_list_1[-1].append("hello")
print(my_list_1)

# c. წაშლის მეორე ინდექსზე მდგომ ელემენტს და დაბეჭდავს სიას;
del my_list_1[2]
print(my_list_1)

# d. შექმენით ახალი სია my_llist_2, რომელსაც ექნება my_llist_1-ის მნიშვნელობა, გაასუფთავეთ my_llist_2-ის მნიშნველობა და დაბეჭდეთ ორივე სია.

# მინიშნება: სიის გასუფთავება – arr.clear()
my_list_2 = my_list_1.copy()
my_list_2.clear()
print("my_list_1:", my_list_1)
print("my_list_2:", my_list_2)


# 3. დაწერეთ პითნის პროგრამა, რომელიც მიიღებს ტელეფონის ნომერს და regex-ით შეამოწმებს შეყვანილი ნომერი იცავს თუ არა "(123) 456-789" ფორმატს, თუ იცავს დააბრუნეთ შეყნვაილი ტელეფონის ნომერი, წინააღმდეგ შემთხვევაში გამოიტანეთ "Invalid format" ტექსტი.

# # მინიშნება: სრული დამთხვევისთვის გამოიყენეთ .fullmatch() მეთოდი re მოდულიდან.

import re
phone_number = input("შეიყვანეთ ტელეფონის ნომერი ფორმატში (123) 456-789: ")
pattern = r"\(\d{3}\) \d{3}-\d{3}"
if re.fullmatch(pattern, phone_number):
    print("შეყვანილი ტელეფონის ნომერი:", phone_number)
else:   
    print("Invalid format") 
    
